Openfoam-Xeon-host/OpenFOAM-2.3.1/tutorials/combustion/fireFoam/les/flameSpreadWaterSuppressionPanel/system/filmRegion/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    boundary
    {
        region0_to_filmRegion_coupledWall
        {
            samplePatch    region0_to_pyrolysisRegion_coupledWall;
        }
    }
}


// ************************************************************************* //
